# Trabalho de Python

### Imports:

In [1]:
# Pandas é evidente para que serve
import pandas as pd

In [2]:
# Chardet para verificar o encoding, só isso.
import chardet

In [3]:
import openpyxl

In [4]:
import re

### Encoding

In [5]:
# Lista dos arquivos CSV
arquivos_csv = ["vendas_bike_2017.csv", "vendas_bike_2018.csv" , "vendas_bike_2019.csv", "vendas_bike_2020.csv"]

# Verificando o encoding de cada arquivo
for arquivo in arquivos_csv:
    with open(arquivo, 'rb') as a:
        result = chardet.detect(a.read())

    # Exibindo a codificação detectada para cada arquivo
    print(f"Encoding do arquivo {arquivo}: {result['encoding']}")

Encoding do arquivo vendas_bike_2017.csv: ascii
Encoding do arquivo vendas_bike_2018.csv: ascii
Encoding do arquivo vendas_bike_2019.csv: utf-8
Encoding do arquivo vendas_bike_2020.csv: utf-8

In [6]:
df_2017 = pd.read_csv('vendas_bike_2017.csv', encoding='ascii', sep=';')
df_2018 = pd.read_csv('vendas_bike_2018.csv', encoding='ascii', sep=';')
df_2019 = pd.read_csv('vendas_bike_2019.csv', encoding='utf-8', sep=';')
df_2020 = pd.read_csv('vendas_bike_2020.csv', encoding='utf-8', sep=';')

### Shapes e infos

In [7]:
df_2017.shape

(170, 10)

In [8]:
df_2017.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 170 entries, 0 to 169
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Categoria           170 non-null    object
 1   ID_Subcategoria     170 non-null    float64
 2   ID_Modelo           170 non-null    float64
 3   Cor                 170 non-null    object
 4   UF                  170 non-null    object
 5   ID_Cidade           170 non-null    float64
 6   ID_Regiao           170 non-null    float64
 7   Quantidade Vendida  170 non-null    int64
 8   Total Venda         170 non-null    float64
 9   Data Venda          170 non-null    object
dtypes: float64(5), int64(1), object(4)
memory usage: 13.4+ KB

In [9]:
df_2018.shape

(175, 10)

In [10]:
df_2018.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 175 entries, 0 to 174
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Categoria           175 non-null    object
 1   ID_Subcategoria     175 non-null    float64
 2   ID_Modelo           175 non-null    float64
 3   Cor                 175 non-null    object
 4   UF                  175 non-null    object
 5   ID_Cidade           175 non-null    float64
 6   ID_Regiao           175 non-null    float64
 7   Quantidade Vendida  175 non-null    int64
 8   Total Venda         175 non-null    float64
 9   Data Venda          175 non-null    object
dtypes: float64(5), int64(1), object(4)
memory usage: 13.8+ KB

In [11]:
df_2019.shape

(391, 10)

In [12]:
df_2019.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 391 entries, 0 to 390
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Categoria           391 non-null    object
 1   ID_Subcategoria     391 non-null    float64
 2   ID_Modelo           391 non-null    float64
 3   Cor                 262 non-null    object
 4   UF                  391 non-null    object
 5   ID_Cidade           391 non-null    float64
 6   ID_Regiao           391 non-null    float64
 7   Quantidade Vendida  391 non-null    int64
 8   Total Venda         391 non-null    float64
 9   Data Venda          391 non-null    object
dtypes: float64(5), int64(1), object(4)
memory usage: 30.7+ KB

In [13]:
df_2020.shape

(264, 10)

In [14]:
df_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264 entries, 0 to 263
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Categoria           264 non-null    object
 1   ID_Subcategoria     264 non-null    float64
 2   ID_Modelo           264 non-null    float64
 3   Cor                 157 non-null    object
 4   UF                  264 non-null    object
 5   ID_Cidade           264 non-null    float64
 6   ID_Regiao           264 non-null    float64
 7   Quantidade Vendida  264 non-null    int64
 8   Total Venda         264 non-null    float64
 9   Data Venda          264 non-null    object
dtypes: float64(5), int64(1), object(4)
memory usage: 20.8+ KB

### Juntando as Tabelas e verificando com shape e info

In [15]:
df_juntas = pd.concat([df_2017, df_2018, df_2019, df_2020], ignore_index=True)

In [16]:
df_juntas.shape

(1000, 10)

In [17]:
df_juntas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Categoria           1000 non-null   object
 1   ID_Subcategoria     1000 non-null   float64
 2   ID_Modelo           1000 non-null   float64
 3   Cor                 764 non-null    object
 4   UF                  1000 non-null   object
 5   ID_Cidade           1000 non-null   float64
 6   ID_Regiao           1000 non-null   float64
 7   Quantidade Vendida  1000 non-null   int64
 8   Total Venda         1000 non-null   float64
 9   Data Venda          1000 non-null   object
dtypes: float64(5), int64(1), object(4)
memory usage: 78.3+ KB

### <p style="color:red;">⚠️ Ainda preciso tratar esses dados: há valores nulos e os tipos estão incorretos.</p>

o que pergunta para prof:
sobre os nulos
data mudar 
nomes mudar

### Abrindo os Excel

In [18]:
df_cidade = pd.read_excel('cidade.xlsx')

In [19]:
df_cidade.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      1000 non-null   int64
 1   Cidade  1000 non-null   object
dtypes: int64(1), object(1)
memory usage: 15.8+ KB

In [20]:
df_cidade.head()

   ID         Cidade
0   1       Passagem
1   2  Córrego Fundo
2   3    Quebrangulo
3   4        Varjota
4   5       Jucurutu

In [21]:
df_estado = pd.read_excel('estado.xlsx')

In [22]:
df_estado.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Estado  27 non-null     object
 1   Sigla   27 non-null     object
dtypes: object(2)
memory usage: 564.0+ bytes

In [23]:
df_estado.head()

                Estado Sigla
0              Paraíba    PB
1         Minas Gerais    MG
2              Alagoas    AL
3                Ceará    CE
4  Rio Grande do Norte    RN

In [24]:
df_modelo = pd.read_excel("modelo.xlsx")

In [25]:
df_modelo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      70 non-null     int64
 1   Modelo  70 non-null     object
dtypes: int64(1), object(1)
memory usage: 1.2+ KB

In [26]:
df_modelo.head()

   ID        Modelo
0   1  Mountain-100
1   2      Road-150
2   3      Road-650
3   4  Mountain-200
4   5      Road-250

In [27]:
df_regiao = pd.read_excel("regiao.xlsx")

In [28]:
df_regiao.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   Região  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 212.0+ bytes

In [29]:
df_regiao

   ID        Região
0   1      Nordeste
1   2       Sudeste
2   3         Norte
3   4  Centro-Oeste
4   5           Sul

In [30]:
df_subcategorias = pd.read_excel("subcategorias.xlsx")

In [31]:
df_subcategorias.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            28 non-null     int64
 1   SubCategoria  28 non-null     object
dtypes: int64(1), object(1)
memory usage: 580.0+ bytes

In [32]:
df_subcategorias.head()

   ID            SubCategoria
0   1  Bicicletas de montanha
1   2   Bicicletas de estrada
2   3           Bicicletários
3   4      Garrafas e Gaiolas
4   5           Pneus e Tubos

### Tratando os nomes das colunas

In [33]:
df_juntas.head()

,Categoria,ID_Subcategoria,ID_Modelo,Cor,UF,ID_Cidade,ID_Regiao,Quantidade Vendida,Total Venda,Data Venda
0,Bicicletas,1.0,1.0,Prata,PB,1.0,1.0,2,6799.98,01/07/2017
1,Bicicletas,2.0,2.0,Vermelho,PB,1.0,1.0,2,7156.54,01/10/2017
2,Bicicletas,2.0,3.0,Preto,RN,19.0,1.0,1,3578.27,01/12/2017
3,Bicicletas,2.0,2.0,Vermelho,MG,2.0,2.0,1,3578.27,01/07/2017
4,Bicicletas,1.0,1.0,Prata,SP,20.0,2.0,1,3578.27,01/07/2017

In [34]:
df_juntas = df_juntas.rename(columns={'ID_Subcategoria': 'id_subcategoria'})

In [35]:
df_juntas = df_juntas.rename(columns={
    'ID_Subcategoria': 'id_subcategoria',
    'Categoria': 'categoria',
    'ID_Modelo': 'id_modelo',
    'Cor':'cor',
    'UF':'uf',
    'ID_Cidade':'id_cidade',
    'ID_Regiao':'id_regiao',
    'Quantidade Vendida':'qtd_vendida',
    'Total Venda':'total_venda',
    'Data Venda':'data_venda'
    })

In [36]:
df_juntas.head()

,categoria,id_subcategoria,id_modelo,cor,uf,id_cidade,id_regiao,qtd_vendida,total_venda,data_venda
0,Bicicletas,1.0,1.0,Prata,PB,1.0,1.0,2,6799.98,01/07/2017
1,Bicicletas,2.0,2.0,Vermelho,PB,1.0,1.0,2,7156.54,01/10/2017
2,Bicicletas,2.0,3.0,Preto,RN,19.0,1.0,1,3578.27,01/12/2017
3,Bicicletas,2.0,2.0,Vermelho,MG,2.0,2.0,1,3578.27,01/07/2017
4,Bicicletas,1.0,1.0,Prata,SP,20.0,2.0,1,3578.27,01/07/2017

In [37]:
df_juntas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   categoria        1000 non-null   object
 1   id_subcategoria  1000 non-null   float64
 2   id_modelo        1000 non-null   float64
 3   cor              764 non-null    object
 4   uf               1000 non-null   object
 5   id_cidade        1000 non-null   float64
 6   id_regiao        1000 non-null   float64
 7   qtd_vendida      1000 non-null   int64
 8   total_venda      1000 non-null   float64
 9   data_venda       1000 non-null   object
dtypes: float64(5), int64(1), object(4)
memory usage: 78.3+ KB

### Tradando os nomes dos Excel:

In [38]:
df_regiao

   ID        Região
0   1      Nordeste
1   2       Sudeste
2   3         Norte
3   4  Centro-Oeste
4   5           Sul

In [39]:
df_regiao = df_regiao.rename(columns={
    'ID': 'id_regiao',
    'Região': 'regiao'
})

In [40]:
df_regiao

   id_regiao        regiao
0          1      Nordeste
1          2       Sudeste
2          3         Norte
3          4  Centro-Oeste
4          5           Sul

In [41]:
df_estado.head()

                Estado Sigla
0              Paraíba    PB
1         Minas Gerais    MG
2              Alagoas    AL
3                Ceará    CE
4  Rio Grande do Norte    RN

In [42]:
df_estado = df_estado.rename(columns={
    'Estado': 'estado',
    'Sigla': 'uf'
})

In [43]:
df_estado.head()

                estado  uf
0              Paraíba  PB
1         Minas Gerais  MG
2              Alagoas  AL
3                Ceará  CE
4  Rio Grande do Norte  RN

In [44]:
df_cidade.head()

   ID         Cidade
0   1       Passagem
1   2  Córrego Fundo
2   3    Quebrangulo
3   4        Varjota
4   5       Jucurutu

In [45]:
df_cidade = df_cidade.rename(columns={
    'ID': 'id_cidade',
    'Cidade': 'cidade'
})

In [46]:
df_cidade.head()

   id_cidade         cidade
0          1       Passagem
1          2  Córrego Fundo
2          3    Quebrangulo
3          4        Varjota
4          5       Jucurutu

In [47]:
df_modelo.head()

   ID        Modelo
0   1  Mountain-100
1   2      Road-150
2   3      Road-650
3   4  Mountain-200
4   5      Road-250

In [48]:
df_modelo = df_modelo.rename(columns={
    'ID': 'id_modelo',
    'Modelo': 'modelo'
})

In [49]:
df_modelo.head()

   id_modelo        modelo
0          1  Mountain-100
1          2      Road-150
2          3      Road-650
3          4  Mountain-200
4          5      Road-250

In [50]:
df_subcategorias.head()

   ID            SubCategoria
0   1  Bicicletas de montanha
1   2   Bicicletas de estrada
2   3           Bicicletários
3   4      Garrafas e Gaiolas
4   5           Pneus e Tubos

In [51]:
df_subcategorias = df_subcategorias.rename(columns={
    'ID': 'id_subcategoria',
    'SubCategoria': 'subcategoria'
})

In [52]:
df_subcategorias.head()

   id_subcategoria            subcategoria
0                1  Bicicletas de montanha
1                2   Bicicletas de estrada
2                3           Bicicletários
3                4      Garrafas e Gaiolas
4                5           Pneus e Tubos

### Tratando os dados nulos

In [53]:
df_juntas.isna().any()

categoria          False
id_subcategoria    False
id_modelo          False
cor                 True
uf                 False
id_cidade          False
id_regiao          False
qtd_vendida        False
total_venda        False
data_venda         False
dtype: bool

In [54]:
df_juntas[df_juntas.isnull().any(axis=1)]

,categoria,id_subcategoria,id_modelo,cor,uf,id_cidade,id_regiao,qtd_vendida,total_venda,data_venda
348,Acessórios,5.0,9.0,NaN,CE,4.0,1.0,1,3578.27,01/09/2019
354,Acessórios,4.0,13.0,NaN,RO,7.0,3.0,1,3374.99,01/10/2019
356,Acessórios,4.0,31.0,NaN,SP,9.0,2.0,1,3578.27,01/09/2019
365,Acessórios,4.0,8.0,NaN,MG,28.0,2.0,1,782.99,01/09/2019
370,Acessórios,5.0,15.0,NaN,MG,48.0,2.0,1,3578.27,01/08/2019
...,...,...,...,...,...,...,...,...,...,...
991,Acessórios,4.0,13.0,NaN,MS,523.0,4.0,1,2.29,01/04/2020
992,Acessórios,11.0,25.0,NaN,SP,526.0,2.0,1,32.60,01/04/2020
993,Acessórios,5.0,38.0,NaN,RN,527.0,1.0,1,3578.27,01/04/2020
994,Acessórios,11.0,25.0,NaN,MT,541.0,4.0,1,3578.27,03/06/2020
995,Acessórios,4.0,8.0,NaN,RS,542.0,5.0,1,32.60,01/04/2020

In [55]:
df_juntas[df_juntas['cor'].isnull()]['categoria'].value_counts()

categoria
Acessórios     233
Componentes      3
Name: count, dtype: int64

In [56]:
df_juntas['cor'] = df_juntas['cor'].fillna('Sem cor')

In [57]:
df_juntas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   categoria        1000 non-null   object
 1   id_subcategoria  1000 non-null   float64
 2   id_modelo        1000 non-null   float64
 3   cor              1000 non-null   object
 4   uf               1000 non-null   object
 5   id_cidade        1000 non-null   float64
 6   id_regiao        1000 non-null   float64
 7   qtd_vendida      1000 non-null   int64
 8   total_venda      1000 non-null   float64
 9   data_venda       1000 non-null   object
dtypes: float64(5), int64(1), object(4)
memory usage: 78.3+ KB

### Agora mudando os tipos das colunas:

In [58]:
# Começando pela data
df_juntas['data_venda'] = pd.to_datetime(df_juntas['data_venda'])

In [59]:
#df_juntas['id_subcategoria'] = pd.(df_juntas['id_subcategoria'])

In [60]:
# Verifica se algum valor tem parte decimal diferente de zero
tem_quebrado = df_juntas['id_modelo'].apply(lambda x: (x % 1) != 0).any()

print(f"A coluna 'id_modelo' tem valores quebrados? {tem_quebrado}")

A coluna 'id_modelo' tem valores quebrados? False

In [61]:
df_juntas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   categoria        1000 non-null   object
 1   id_subcategoria  1000 non-null   float64
 2   id_modelo        1000 non-null   float64
 3   cor              1000 non-null   object
 4   uf               1000 non-null   object
 5   id_cidade        1000 non-null   float64
 6   id_regiao        1000 non-null   float64
 7   qtd_vendida      1000 non-null   int64
 8   total_venda      1000 non-null   float64
 9   data_venda       1000 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(5), int64(1), object(3)
memory usage: 78.3+ KB